Конфигурация/src/Documents/РасходнаяНакладнаяНаМатериалы/РасходнаяНакладнаяНаМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладнаяНаМатериалы</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ОстаткиПродукции/ОстаткиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/РасходнаяНакладнаяНаМатериалы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
	Движения.ОстаткиПродукции.Записывать = Истина;
	Движения.ОстаткиПродукции.Очистить(); 
	
    ЕстьНехватка = Ложь;
    ТекстНехватки = "";
    
    // 1. Получение списка продукции для запроса остатков
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |    РасходнаяНакладнаяМатериалы.Материал
    |ИЗ
    |    Документ.РасходнаяНакладнаяНаМатериалы.Материалы КАК РасходнаяНакладнаяМатериалы
    |ГДЕ
    |    РасходнаяНакладнаяМатериалы.Ссылка = &Ссылка";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаПродукции = РезультатЗапроса.Выгрузить(); 
	СписокПродукции = ТаблицаПродукции.ВыгрузитьКолонку("Материал");
    
    // Проверка на пустую ТЧ
    Если СписокПродукции.Количество() = 0 Тогда
        Отказ = Истина;
        Сообщить("Табличная часть Материалы пуста. Проведение отменено.");
        Возврат;
    КонецЕсли;
    
    // 2. Получение текущих остатков
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ОстаткиПродукцииОстатки.Продукция,
    |    ЕСТЬNULL(ОстаткиПродукцииОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток, // Защита от NULL
    |    ЕСТЬNULL(ОстаткиПродукцииОстатки.СуммаОстаток, 0) КАК СуммаОстаток           // Защита от NULL
    |ИЗ
    |    РегистрНакопления.ОстаткиПродукции.Остатки(
    |            &МоментВремени,
    |            Продукция В (&СписокПродукции)) КАК ОстаткиПродукцииОстатки";
            
    Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
    Запрос.УстановитьПараметр("СписокПродукции", СписокПродукции);
    
    ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
    // Индекс или Найти() не используем! Используем цикл (как в рабочем коде)
    
    // 3. Проверка остатков и формирование движений
    Для Каждого СтрокаТЧ Из Материалы Цикл
        
        // --- ГАРАНТИРОВАННЫЙ ПОИСК ЦИКЛОМ (как в рабочем коде) ---
        СтрокаОстатка = Неопределено;
        Для Каждого СтрокаОста Из ТаблицаОстатков Цикл
            Если СтрокаОста.Продукция = СтрокаТЧ.Материал Тогда // Ищем по ссылке
                СтрокаОстатка = СтрокаОста;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        // Значения по умолчанию
        Доступно = 0;
        СуммаОстаток = 0;
        
        // Если нашли, присваиваем данные (они гарантированно не NULL)
        Если СтрокаОстатка <> Неопределено Тогда
            Доступно = СтрокаОстатка.КоличествоОстаток;
            СуммаОстаток = СтрокаОстатка.СуммаОстаток;
        КонецЕсли;
        
        // 4. Проверка на достаточность остатка
        Если СтрокаТЧ.Количество > Доступно Тогда
            // Не хватило: фиксируем нехватку и ОТМЕНЯЕМ ПРОВЕДЕНИЕ
            ЕстьНехватка = Истина;
            Отказ = Истина; // <--- Отмена проведения!
            ТекстНехватки = ТекстНехватки 
                + "Не хватило " + СтрокаТЧ.Материал 
                + " (Требовалось: " + СтрокаТЧ.Количество 
                + ", Доступно: " + Доступно + "); ";
            Продолжить;
        КонецЕсли;
        
        // Расчет средней себестоимости для списания
        СписываемаяСумма = 0;
        Если Доступно > 0 Тогда
            СредняяСтоимость = СуммаОстаток / Доступно;
            СписываемаяСумма = СредняяСтоимость * СтрокаТЧ.Количество;
        КонецЕсли;
        
        // Создание движения Расход
        Движение = Движения.ОстаткиПродукции.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период      = Дата;
        Движение.Продукция   = СтрокаТЧ.Материал;
        Движение.Количество  = СтрокаТЧ.Количество;
        Движение.Сумма       = СписываемаяСумма; 
        
    КонецЦикла;
    
    // 5. Окончательное сообщение (Отказ уже установлен, если была нехватка)
    Если Отказ Тогда
        Сообщить("Внимание! Отгрузка НЕ проведена из-за нехватки продукции. Комментарий: " + ТекстНехватки, СтатусСообщения.Важное);
    КонецЕсли;
    
КонецПроцедуры
